In [ ]:
%pip install pandas

import pandas as pd
import numpy as np

## Statystyka

In [15]:
a = pd.DataFrame([[1.2,456.6],[np.nan,np.nan],[np.nan,34.7],[2.67,3.7],[np.nan,35.7]],index=["q","w","e","t","y"],columns=["a","s"])

In [16]:
a

      a      s
q  1.20  456.6
w   NaN    NaN
e   NaN   34.7
t  2.67    3.7
y   NaN   35.7

In [ ]:
a.sum(axis=1,skipna=False)

In [ ]:
a.mean(axis="columns")

In [ ]:
a.idxmax()

In [ ]:
a.idxmin()

In [20]:
a

      a      s
q  1.20  456.6
w   NaN    NaN
e   NaN   34.7
t  2.67    3.7
y   NaN   35.7

In [19]:
a.cumsum()

      a      s
q  1.20  456.6
w   NaN    NaN
e   NaN  491.3
t  3.87  495.0
y   NaN  530.7

In [24]:
a.describe()

              a           s
count  2.000000    4.000000
mean   1.935000  132.675000
std    1.039447  216.460318
min    1.200000    3.700000
25%    1.567500   26.950000
50%    1.935000   35.200000
75%    2.302500  140.925000
max    2.670000  456.600000

In [23]:
a.apply(pd.DataFrame.describe, axis=1)

   count     mean         std    min       25%      50%       75%    max
q    2.0  228.900  322.016428   1.20  115.0500  228.900  342.7500  456.6
w    0.0      NaN         NaN    NaN       NaN      NaN       NaN    NaN
e    1.0   34.700         NaN  34.70   34.7000   34.700   34.7000   34.7
t    2.0    3.185    0.728320   2.67    2.9275    3.185    3.4425    3.7
y    1.0   35.700         NaN  35.70   35.7000   35.700   35.7000   35.7

In [25]:
b = pd.Series(["q","w","e","t","y"] * 10)

In [26]:
b

0     q
1     w
2     e
3     t
4     y
5     q
6     w
7     e
8     t
9     y
10    q
11    w
12    e
13    t
14    y
15    q
16    w
17    e
18    t
19    y
20    q
21    w
22    e
23    t
24    y
25    q
26    w
27    e
28    t
29    y
30    q
31    w
32    e
33    t
34    y
35    q
36    w
37    e
38    t
39    y
40    q
41    w
42    e
43    t
44    y
45    q
46    w
47    e
48    t
49    y
dtype: object

In [27]:
b.describe()

count     50
unique     5
top        q
freq      10
dtype: object